In [4]:
import pandas as pd
import numpy as np
index=pd.date_range('1/1/2016',periods=8);
df=pd.DataFrame(np.random.randn(8,3),index=index,columns=list('abc'))

In [5]:
#when you only want to see the values of the DataFrame
df.values

array([[ 0.89998414,  1.04064191, -1.55264944],
       [-0.30585719,  1.02206707,  0.25246082],
       [ 0.94346927, -0.53100264,  0.97175625],
       [ 1.62800798,  0.76805407, -0.23441776],
       [-0.25238887, -1.57312335,  0.36732367],
       [-1.33982998,  0.26092149,  1.80299102],
       [ 1.25361776,  0.19246412,  1.07134418],
       [-0.6949217 ,  1.05580483,  0.40040034]])

In [6]:
#to see smaller set of data-frame use head and tail functions default it shows 5
#but an arguement can be passed to the number of elements

#to show defalut number of elements
df.head()

                   a         b         c
2016-01-01  0.899984  1.040642 -1.552649
2016-01-02 -0.305857  1.022067  0.252461
2016-01-03  0.943469 -0.531003  0.971756
2016-01-04  1.628008  0.768054 -0.234418
2016-01-05 -0.252389 -1.573123  0.367324

In [7]:
#to show particluar number of elements
df.head(8)

                   a         b         c
2016-01-01  0.899984  1.040642 -1.552649
2016-01-02 -0.305857  1.022067  0.252461
2016-01-03  0.943469 -0.531003  0.971756
2016-01-04  1.628008  0.768054 -0.234418
2016-01-05 -0.252389 -1.573123  0.367324
2016-01-06 -1.339830  0.260921  1.802991
2016-01-07  1.253618  0.192464  1.071344
2016-01-08 -0.694922  1.055805  0.400400

In [8]:
df.shape

(8, 3)

# Comparing array like objects

In [9]:
#compares elements along the whole series
pd.Series(['foo','bar','quu'])=='foo'

0     True
1    False
2    False
dtype: bool

In [10]:
#comparing two series or list
#when comparing array like objects both should be of same length otherwise it throws ValueError
pd.Series(['foo','bar','quu'])==pd.Series(['foo','bar','quu'])

0    True
1    True
2    True
dtype: bool

In [11]:
pd.Series(['foo','bar','quu'])==np.array(['foo','bar','barca'])

0     True
1     True
2    False
dtype: bool

# Combine Overlapping Data sets

In [12]:
#when you have to overalapping data sets and want to combine these two data sets such that NA values in first DF should be
#filled with values in the same position of second DF
df1 = pd.DataFrame({'A' : [1., np.nan, 3., 5., np.nan],
                    'B' : [np.nan, 2., 3., np.nan, 6.]})
df2 = pd.DataFrame({'A' : [5., 2., 4., np.nan, 3., 7.],
                    'B' : [np.nan, np.nan, 3., 4., 6., 8.]})

In [13]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [14]:
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [15]:
#to combine overlapping data sets 
nd=df1.combine_first(df2)
nd

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

# to calculate sum along every column of the dataframe

In [16]:
nd.sum(axis=0,skipna=True)

A    21.0
B    23.0
dtype: float64

# Calculate sum along every row of the dataframe

In [17]:
nd.sum(axis=1,skipna=True)

0     1.0
1     4.0
2     6.0
3     9.0
4     9.0
5    15.0
dtype: float64

# Calculate mean along column and row of the DataFrame

In [18]:
#of each column
nd.mean(axis=0,skipna=True)

A    3.5
B    4.6
dtype: float64

In [19]:
#of each row
nd.mean(axis=1,skipna=True)

0    1.0
1    2.0
2    3.0
3    4.5
4    4.5
5    7.5
dtype: float64

# Some more functions can be used from NumPy

In [20]:
nd.min(axis=0,skipna=True)

A    1.0
B    2.0
dtype: float64

# Getting index of min and max element of a column

In [21]:
nd['A'].idxmin() # to get index of minimum

0

In [22]:
nd['A'].idxmax() # to get index of minimum

5

# Value counts

In [23]:
#Series method and top-level function computes a histogram of a 1D array of values
#similar to mode keeps count of each value occuring along a series
data=np.random.randint(3,18,size=50)
data

array([15, 16, 16, 13, 14, 13,  3,  9,  3, 14, 12,  8, 13,  9, 16, 12,  5,
        6, 17, 11, 15, 11,  3,  8, 14, 11,  7,  7,  9,  8, 15, 12, 11, 17,
       11,  8, 12, 11, 16, 14, 12,  9,  4,  9,  6, 16,  5, 10, 15,  8])

In [24]:
s=pd.Series(data)
s.value_counts()

11    6
16    5
12    5
9     5
8     5
15    4
14    4
13    3
3     3
17    2
7     2
6     2
5     2
10    1
4     1
dtype: int64

# Alternate way to apply stat functions

In [25]:
#function supplied as an argument to the apply function
nd.apply(np.mean,axis=0)

A    3.5
B    4.6
dtype: float64

In [26]:
nd.apply(np.sum,axis=1)

0     1.0
1     4.0
2     6.0
3     9.0
4     9.0
5    15.0
dtype: float64

In [27]:
nd.apply(np.cumsum,axis=0)

      A     B
0   1.0   NaN
1   3.0   2.0
2   6.0   5.0
3  11.0   9.0
4  14.0  15.0
5  21.0  23.0

In [29]:
tsdf=pd.DataFrame(np.random.randn(100,4),index=pd.date_range("1/1/2013",periods=100),columns=list('abcd'))
tsdf.head(10)

                   a         b         c         d
2013-01-01 -1.030818 -1.262462  0.879711 -0.509546
2013-01-02 -0.005777  0.031737 -1.136155 -0.351747
2013-01-03 -0.356617 -0.509568  0.226883 -0.221900
2013-01-04  2.027104 -0.371779 -0.933395 -0.903103
2013-01-05 -0.374359 -2.230148  0.319298  0.680319
2013-01-06 -0.349851 -0.810628  0.408079  0.736209
2013-01-07 -0.189068  1.968482 -0.628554 -1.302971
2013-01-08  0.096004 -0.081975 -0.383863 -1.148102
2013-01-09  0.631919  0.011039 -0.299761  1.322719
2013-01-10  0.188057  1.904616  0.832404  0.342292

In [30]:
tsdf.apply(lambda x:x.idxmax())

a   2013-03-30
b   2013-03-04
c   2013-01-11
d   2013-01-31
dtype: datetime64[ns]

In [31]:
#lets create a user defined function and supply it to apply() function
#the first argument will be your series or your DataFrame
def power(x,num):
    return x**num

In [36]:
tsdf.apply(power,args=(2,)).head(15)

                   a         b         c         d
2013-01-01  1.062585  1.593811  0.773891  0.259637
2013-01-02  0.000033  0.001007  1.290848  0.123726
2013-01-03  0.127176  0.259659  0.051476  0.049240
2013-01-04  4.109151  0.138220  0.871226  0.815596
2013-01-05  0.140145  4.973559  0.101951  0.462833
2013-01-06  0.122396  0.657117  0.166528  0.542003
2013-01-07  0.035747  3.874920  0.395080  1.697734
2013-01-08  0.009217  0.006720  0.147351  1.318137
2013-01-09  0.399322  0.000122  0.089857  1.749586
2013-01-10  0.035365  3.627562  0.692897  0.117164
2013-01-11  0.049262  0.231881  6.476573  0.888542
2013-01-12  0.438104  0.382849  0.005491  0.057549
2013-01-13  1.951855  0.439908  0.346693  2.682864
2013-01-14  0.339347  2.634284  1.514517  0.311148
2013-01-15  0.438817  0.181797  2.584130  0.001145

# Aggregation

In [35]:
#aggregation allows multiple functions to be applied to a dataframe in a single and concise way

In [37]:
#lets find mean and sum of different columns of a dataframe in a single and concise way
tsdf.agg([np.sum,np.mean],axis=0)

              a         b          c         d
sum  -13.694037 -0.634822  17.800802  5.316690
mean  -0.136940 -0.006348   0.178008  0.053167

In [38]:
#to get data types of all columns of a DataFrame
tsdf.dtypes

a    float64
b    float64
c    float64
d    float64
dtype: object

In [43]:
tsdf.columns

Index(['a', 'b', 'c', 'd'], dtype='object')